# ----------------------------------------
# Core Dev Tools
# ----------------------------------------
brew "git"
brew "zsh"
brew "tmux"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "tree"
brew "jq"
brew "watch"
brew "fd"
brew "sd"
brew "duf"
brew "dust"
brew "bottom"
brew "zoxide"
brew "tokei"
brew "procs"
brew "libyaml"

# ----------------------------------------
# Programming Languages & Version Managers
# ----------------------------------------
brew "asdf"
brew "node"

# ----------------------------------------
# Databases
# ----------------------------------------
brew "postgresql@16"
brew "redis"
brew "sqlite"

# ----------------------------------------
# Web Dev Utilities
# ----------------------------------------
brew "httpie"
brew "curl"
brew "wget"
brew "imagemagick"

# ----------------------------------------
# Productivity
# ----------------------------------------
brew "chezmoi"
brew "gh"
brew "mas"           # Mac App Store CLI
brew "starship"

# ----------------------------------------
# Cask Apps (GUI)
# ----------------------------------------
cask "arc"
cask "iterm2"
cask "wezterm"
cask "docker"
cask "figma"
cask "raycast"
cask "rectangle"
cask "superhuman"
cask "chatgpt"
cask "notion"
cask "spotify"
cask "whatsapp"
cask "cursor"

mas "HotspotShield VPN", id: 771_076_721
